farmacia-soft/app/controllers/timbrados/timbrados_controller.rb

INSERT INTO `timbrados` (`timbrado`, `serie`, `nro_desde`, `nro_hasta`, `fecha_circulacion`, `fecha_expiracion`, `estado`, `created_at`, `updated_at`) VALUES (123122, '101-101', 3500, 5000, '2018-08-19', '2018-08-31', 1, '2018-08-19 12:31:40', '2018-08-19 12:31:40')
---
   def create
       @timbrado = Timbrado.new(timbrado_params)
        if @timbrado.save

SELECT  `timbrados`.* FROM `timbrados` WHERE `timbrados`.`id` = 1 LIMIT 1
---
  def show
     @timbrado = Timbrado.find(params[:id])

SELECT `timbrados`.* FROM `timbrados`
---
  def index
    @timbrados =Timbrado.all