farmacia-soft/app/controllers/users/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Diego' LIMIT 1
---
  def create
     @user = User.find_by(username: params[:user][:username])