farmacia-soft/app/controllers/users/users_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `username`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('Gustavo', 'Rodriguez', 'Diego', '$2a$10$bb9OK6rEE.JLc7Ny/9mZCeQrNbkUi5qaY9SKddhgxlSL4573gm7yu', 'DpNjPRkqoy2pxYUNZtVN', '2018-08-05 02:04:17', '2018-08-05 02:04:17')
---
   def create
       @user = User.new(user_params)
        if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `salt` = 'R63QkvJsLwDPrKcBLykB', `crypted_password` = '$2a$10$XbeYfJ23Idonu7yqIK7JPuoqPQjhY7SzhcikgJNQrHjlfOigmF1Fu', `updated_at` = '2018-08-04 17:00:03' WHERE `users`.`id` = 1
---
   def update
      @user= User.find(params[:id])
        respond_to do |format|
          if @user.update_attributes(user_params)