farmacia-soft/app/controllers/customers/customers_controller.rb

   def create
       @customer = Customer.new(customer_params)
        if @customer.save
---
INSERT INTO `customers` (`first_name`, `last_name`, `doc_number`, `birthdate`, `nationality`, `address`, `phone`, `sexo`, `created_at`, `updated_at`) VALUES ('Diego Ramon', 'Rodriguez Figueredo', '4546837', '1989-09-01', 'Paraguay', 'Barrio Santa Maria km 3', '+595981526028', 'F', '2018-08-11 11:08:19', '2018-08-11 11:08:19')

  def edit
     @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

   def update
      @customer= Customer.find(params[:id])
        respond_to do |format|
          if @customer.update_attributes(customer_params)
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `nationality` = '', `updated_at` = '2018-08-11 12:42:56' WHERE `customers`.`id` = 1